uat_chat/InformationRegisters/ОшибкиБСМТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ОшибкиБСМТС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОшибки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИсправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПутЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаНеисправности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаИсправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутЛистИсп</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/InformationRegisters/ОшибкиБСМТС/Ext/ManagerModule.bsl
Процедура СделатьЗапись(ТС,ПЛ) Экспорт
	
	Зап = РегистрыСведений.ОшибкиБСМТС.СоздатьМенеджерЗаписи();
	Зап.ТС = ТС;
	Зап.Прочитать();
	
	Если Зап.Выбран() Тогда 
		Если Зап.ДатаИсправления=Дата(1,1,1) Тогда
			Возврат;
		ИНачеЕсли Зап.ПутЛистИсп.Дата > ПЛ.Дата Тогда
			Возврат;
		КонецЕСли;;
	КонецЕСли;
	
	Зап.ТС = ТС;
	Зап.ПутЛист = ПЛ;
	Зап.ДатаОшибки = ТекущаяДАта();
	Зап.ДатаИсправления=Дата(1,1,1);
	Зап.ПутЛистИсп = Неопределено;
	Зап.Записать();
	
КонецПроцедуры

Процедура СнятьЗапись(ТС,ПЛ) Экспорт
	Зап = РегистрыСведений.ОшибкиБСМТС.СоздатьМенеджерЗаписи();
	Зап.ТС = ТС;
	Зап.Прочитать();
	
	Если Зап.Выбран()=Ложь Тогда Возврат; КонецЕСли;
	
	Если Зап.ДатаИсправления<>Дата(1,1,1) Тогда
		Возврат; 
	ИНачеЕсли Зап.ПутЛист.Дата > ПЛ.Дата Тогда
			Возврат;
	КонецЕСли;
	
	
	Зап.ТС = ТС;
	Зап.ПутЛистИсп = ПЛ;
	Зап.ДатаИсправления = ТекущаяДАта();
	Зап.Записать();
		
КонецПроцедуры
